Documentation/IdSrvTokenRequest.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <s:Header>
    <a:Action s:mustUnderstand="1">GetIdentity</a:Action>
    <a:MessageID>urn:uuid:bd9ecec0-3c00-4955-89df-f7753fc35a95</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
    <VsDebuggerCausalityData xmlns="http://schemas.microsoft.com/vstudio/diagnostics/servicemodelsink">uIDPo4a81CpmkGRIhjqpuIPeM00AAAAA8hiiA/SmnkK3QTkAgFiQ/mvuE67eOcNNhFMr1HRj9QkACQAA</VsDebuggerCausalityData>
    <a:To s:mustUnderstand="1">https://windows7:444/identity/wstrust</a:To>
    <o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <u:Timestamp u:Id="_0">
        <u:Created>2013-05-17T17:43:46.722Z</u:Created>
        <u:Expires>2013-05-17T17:48:46.722Z</u:Expires>
      </u:Timestamp>
      <Assertion ID="_9772e188-87f4-46c3-939b-b961dec884bd" IssueInstant="2013-05-17T17:43:26.504Z" Version="2.0" xmlns="urn:oasis:names:tc:SAML:2.0:assertion">
        <Issuer>http://identityserver.v2.thinktecture.com/trust/changethis</Issuer>
        <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
          <SignedInfo>
            <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
            <Reference URI="#_9772e188-87f4-46c3-939b-b961dec884bd">
              <Transforms>
                <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
              </Transforms>
              <DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
              <DigestValue>HShE31iGtfTKU2zpryhBZZ52AifPi2zYYi5kWSX+aU8=</DigestValue>
            </Reference>
          </SignedInfo>
          <SignatureValue>p65nGdT8PgiRWqq3hGztTQdsS3aExpmsy0vWRyddUwuLQ2e6y0fBmsW8Mb2Q0AYmga0zcgCZzTG+yqw1oJr/y+8fkJfWU0VeWo8lYTyq4iKLxzj9/a4VrHbEpGc327bkjvt21we0W/+Gi+XzafREbtFZ68a4ISgxHoSkZABJhlHntswutOlTzp3arnse9tEi2puqKPDclXVIwC3L1mTGp3OmC/LCXNj2P0Gb+2LabIOw+wsk77sr94YrnDUJUqPR7tCtd3VWGeMHKC5s3ODrdglpqtxoCqHyzgpz+SMS6k2/T3Gy4XkUVLNswQGISb/bZH7Ku/jULcSUMrHyaByYWw==</SignatureValue>
          <KeyInfo>
            <X509Data>
              <X509Certificate>MIIC1DCCAbygAwIBAgIQOyN9FYAoGLRJmetQ8G0D+zANBgkqhkiG9w0BAQUFADATMREwDwYDVQQDEwhXSU5ET1dTNzAeFw0xMzA1MTExNTE1NThaFw0xNDA1MTEwMDAwMDBaMBMxETAPBgNVBAMTCFdJTkRPV1M3MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA1tR/ZEoeuUsSiCFsN9+wJhnTJafZECwRd14Q+J5lGXK7AaUaUGaB2xHmlcxlTZ7I1GlAajrlr3xPK3ndfJ1X+ZG/eTg6MrQWq28iveilTR58rk/jBeni90at3h+0UtgNEdyTTw1AxbqQ8i5JFl2bafNqccxEaow5lyuPARUx1ek2ZNkJ0EvkqWItcbBi+dmIbTT6q976umZN38fC3XNQA9gqs1ZT+arANrXK56Qyq2L2f1VobECIuSbTW3iWSA3rSHfCJkW8jKPcSO5CFNymTe7YQJVhVD1x8lPM1T0yna3g4OQsK3XCpAvY7oZZrYSGibNEkGeMskqfSze2H2ouDQIDAQABoyQwIjALBgNVHQ8EBAMCBDAwEwYDVR0lBAwwCgYIKwYBBQUHAwEwDQYJKoZIhvcNAQEFBQADggEBAGCR1k9CjyJpHsBxkVtc6bU82mcq/y2boBvC5w64E5C64p1cph/4tqZioFGR3ZvmBpByroUTwkaP+49wihP32hmGnSDfOHArdiQtqqt2Gqg22W9V/1gJw09kF8NtnZf4TUUkDzKfqtucE+fkNWLn+ODD3+07T6T+0z4llBG0moMJMHuTDN/TtdJJe/7nwg3Y0X0uKbq0yIb8c12FjyGs86EYZLEcUQFhdHZAhj5TvnuLmIsjQ2sr0EVEudHWby37MNMu8Ul205Dzg9IxZKXRdfdXKU2BB95ePFG0tTheNjARP/igsMPTSSaO+4USX25aBjdO2TriIrRF9xfYxp2sAYw=</X509Certificate>
            </X509Data>
          </KeyInfo>
        </Signature>
        <Subject>
          <SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"/>
        </Subject>
        <Conditions NotBefore="2013-05-17T17:43:26.417Z" NotOnOrAfter="2013-05-18T03:43:26.417Z">
          <AudienceRestriction>
            <Audience>https://windows7:444/identity/wstrust/bearer</Audience>
          </AudienceRestriction>
        </Conditions>
        <AttributeStatement>
          <Attribute Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/name">
            <AttributeValue>bob</AttributeValue>
          </Attribute>
          <Attribute Name="http://identityserver.thinktecture.com/claims/profileclaims/twittername">
            <AttributeValue/>
          </Attribute>
          <Attribute Name="http://identityserver.thinktecture.com/claims/profileclaims/city">
            <AttributeValue/>
          </Attribute>
          <Attribute Name="http://identityserver.thinktecture.com/claims/profileclaims/homepage">
            <AttributeValue/>
          </Attribute>
        </AttributeStatement>
        <AuthnStatement AuthnInstant="2013-05-17T17:43:26.216Z">
          <AuthnContext>
            <AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:Password</AuthnContextClassRef>
          </AuthnContext>
        </AuthnStatement>
      </Assertion>
    </o:Security>
  </s:Header>
  <s:Body>
    <GetIdentity xmlns="urn:tt"/>
  </s:Body>
</s:Envelope>